MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAG169/mcu.h
extern volatile __GLCDCLUT62bits_t GLCDCLUT62bits __asm__ ("GLCDCLUT62") __attribute__((section("sfrs"), address(0xBF8EA4F8)));
#define GLCDCLUT63 GLCDCLUT63
extern volatile uint32_t   GLCDCLUT63 __attribute__((section("sfrs"), address(0xBF8EA4FC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT63bits_t;
extern volatile __GLCDCLUT63bits_t GLCDCLUT63bits __asm__ ("GLCDCLUT63") __attribute__((section("sfrs"), address(0xBF8EA4FC)));
#define GLCDCLUT64 GLCDCLUT64
extern volatile uint32_t   GLCDCLUT64 __attribute__((section("sfrs"), address(0xBF8EA500)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT64bits_t;
extern volatile __GLCDCLUT64bits_t GLCDCLUT64bits __asm__ ("GLCDCLUT64") __attribute__((section("sfrs"), address(0xBF8EA500)));
#define GLCDCLUT65 GLCDCLUT65
extern volatile uint32_t   GLCDCLUT65 __attribute__((section("sfrs"), address(0xBF8EA504)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT65bits_t;
extern volatile __GLCDCLUT65bits_t GLCDCLUT65bits __asm__ ("GLCDCLUT65") __attribute__((section("sfrs"), address(0xBF8EA504)));
#define GLCDCLUT66 GLCDCLUT66
extern volatile uint32_t   GLCDCLUT66 __attribute__((section("sfrs"), address(0xBF8EA508)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT66bits_t;
extern volatile __GLCDCLUT66bits_t GLCDCLUT66bits __asm__ ("GLCDCLUT66") __attribute__((section("sfrs"), address(0xBF8EA508)));
#define GLCDCLUT67 GLCDCLUT67
extern volatile uint32_t   GLCDCLUT67 __attribute__((section("sfrs"), address(0xBF8EA50C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT67bits_t;
extern volatile __GLCDCLUT67bits_t GLCDCLUT67bits __asm__ ("GLCDCLUT67") __attribute__((section("sfrs"), address(0xBF8EA50C)));
#define GLCDCLUT68 GLCDCLUT68
extern volatile uint32_t   GLCDCLUT68 __attribute__((section("sfrs"), address(0xBF8EA510)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT68bits_t;
extern volatile __GLCDCLUT68bits_t GLCDCLUT68bits __asm__ ("GLCDCLUT68") __attribute__((section("sfrs"), address(0xBF8EA510)));
#define GLCDCLUT69 GLCDCLUT69
extern volatile uint32_t   GLCDCLUT69 __attribute__((section("sfrs"), address(0xBF8EA514)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT69bits_t;
extern volatile __GLCDCLUT69bits_t GLCDCLUT69bits __asm__ ("GLCDCLUT69") __attribute__((section("sfrs"), address(0xBF8EA514)));
#define GLCDCLUT70 GLCDCLUT70
extern volatile uint32_t   GLCDCLUT70 __attribute__((section("sfrs"), address(0xBF8EA518)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT70bits_t;
extern volatile __GLCDCLUT70bits_t GLCDCLUT70bits __asm__ ("GLCDCLUT70") __attribute__((section("sfrs"), address(0xBF8EA518)));
#define GLCDCLUT71 GLCDCLUT71
extern volatile uint32_t   GLCDCLUT71 __attribute__((section("sfrs"), address(0xBF8EA51C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT71bits_t;
extern volatile __GLCDCLUT71bits_t GLCDCLUT71bits __asm__ ("GLCDCLUT71") __attribute__((section("sfrs"), address(0xBF8EA51C)));
#define GLCDCLUT72 GLCDCLUT72
extern volatile uint32_t   GLCDCLUT72 __attribute__((section("sfrs"), address(0xBF8EA520)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT72bits_t;
extern volatile __GLCDCLUT72bits_t GLCDCLUT72bits __asm__ ("GLCDCLUT72") __attribute__((section("sfrs"), address(0xBF8EA520)));
#define GLCDCLUT73 GLCDCLUT73
extern volatile uint32_t   GLCDCLUT73 __attribute__((section("sfrs"), address(0xBF8EA524)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT73bits_t;
extern volatile __GLCDCLUT73bits_t GLCDCLUT73bits __asm__ ("GLCDCLUT73") __attribute__((section("sfrs"), address(0xBF8EA524)));
#define GLCDCLUT74 GLCDCLUT74
extern volatile uint32_t   GLCDCLUT74 __attribute__((section("sfrs"), address(0xBF8EA528)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT74bits_t;
extern volatile __GLCDCLUT74bits_t GLCDCLUT74bits __asm__ ("GLCDCLUT74") __attribute__((section("sfrs"), address(0xBF8EA528)));
#define GLCDCLUT75 GLCDCLUT75
extern volatile uint32_t   GLCDCLUT75 __attribute__((section("sfrs"), address(0xBF8EA52C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT75bits_t;
extern volatile __GLCDCLUT75bits_t GLCDCLUT75bits __asm__ ("GLCDCLUT75") __attribute__((section("sfrs"), address(0xBF8EA52C)));
#define GLCDCLUT76 GLCDCLUT76
extern volatile uint32_t   GLCDCLUT76 __attribute__((section("sfrs"), address(0xBF8EA530)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT76bits_t;
extern volatile __GLCDCLUT76bits_t GLCDCLUT76bits __asm__ ("GLCDCLUT76") __attribute__((section("sfrs"), address(0xBF8EA530)));
#define GLCDCLUT77 GLCDCLUT77
extern volatile uint32_t   GLCDCLUT77 __attribute__((section("sfrs"), address(0xBF8EA534)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT77bits_t;
extern volatile __GLCDCLUT77bits_t GLCDCLUT77bits __asm__ ("GLCDCLUT77") __attribute__((section("sfrs"), address(0xBF8EA534)));
#define GLCDCLUT78 GLCDCLUT78
extern volatile uint32_t   GLCDCLUT78 __attribute__((section("sfrs"), address(0xBF8EA538)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT78bits_t;
extern volatile __GLCDCLUT78bits_t GLCDCLUT78bits __asm__ ("GLCDCLUT78") __attribute__((section("sfrs"), address(0xBF8EA538)));
#define GLCDCLUT79 GLCDCLUT79
extern volatile uint32_t   GLCDCLUT79 __attribute__((section("sfrs"), address(0xBF8EA53C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT79bits_t;
extern volatile __GLCDCLUT79bits_t GLCDCLUT79bits __asm__ ("GLCDCLUT79") __attribute__((section("sfrs"), address(0xBF8EA53C)));
#define GLCDCLUT80 GLCDCLUT80
extern volatile uint32_t   GLCDCLUT80 __attribute__((section("sfrs"), address(0xBF8EA540)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT80bits_t;
